{"inkVersion":21,"root":[[{"->":"johnny_intro"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"johnny_intro":[["^JOHNNY:","\n","^Well, now, look what the wind blew in. Name’s Johnny Miller. Not much left of the old farming days, but I reckon there’s still a bit of life in the soil yet. This here? It’s all that stands between us and starvation. Used to be, the land could feed a nation. Now, it’s a struggle just to grow a handful of greens.","\n","ev","str","^“What happened to the land?”","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^“How do you keep anything growing in this mess?”","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^“Can you spare some food?”","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"collapse_explanation"},{"#f":5}],"c-1":["\n",{"->":"collapse_explanation"},{"#f":5}],"c-2":["\n",{"->":"collapse_explanation"},{"#f":5}]}],{"#f":1}],"collapse_explanation":[["^JOHNNY:","\n","^It wasn’t always like this. Before the Collapse, we had seasons, rain, soil rich with nutrients. But then came the pollution, the heatwaves, the storms. Bit by bit, the earth gave up. Crops failed, livestock died, and the land turned toxic. The soil’s poisoned now—most of it, anyway. Only a few things still grow, and those that do ain’t what they used to be. Mushrooms, a slice of bread if you’re lucky, and maybe a baguette on a good day. But most everything else? It’s as good as poison.","\n","ev","str","^“So what should I eat to stay alive?”","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^“And how do I know what’s safe?”","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^“What happens if I eat something that’s poisoned?”","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"hunger_mechanics"},{"#f":5}],"c-1":["\n",{"->":"hunger_mechanics"},{"#f":5}],"c-2":["\n",{"->":"hunger_mechanics"},{"#f":5}]}],{"#f":1}],"hunger_mechanics":[["^JOHNNY:","\n","^Listen close, because this is important. Out here, hunger ain’t just a feeling—it’s a fight for survival. There’s three things you can count on to keep you going: mushrooms, a slice of bread, and if you’re real fortunate, a baguette. Those’ll fill your belly and keep you strong. And for drinkin’, clean water is your best bet. There’s still a few places you can find it, if you know where to look. And every now and then, you might stumble on a can of soda. It’s rare, but it’ll quench your thirst. Everything else out there? It’ll do more harm than good. The land’s sick, and anything it bears is likely to be poisoned. If you eat or drink the wrong thing, it’ll drain your health, maybe even kill you if you’re not careful.","\n","ev","str","^“Thanks for the advice. What’s next?”","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^“Is there anything you can do to help?”","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^“How did it get this bad?”","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"offer_food"},{"#f":5}],"c-1":["\n",{"->":"offer_food"},{"#f":5}],"c-2":["\n",{"->":"offer_food"},{"#f":5}]}],{"#f":1}],"offer_food":[["^JOHNNY:","\n","^Tell you what—I’ve got a few mushrooms and a baguette I can spare. It ain’t much, but it’ll keep you on your feet for a while. You’ll need to keep an eye out for more as you go. And remember, what little grows here is all we’ve got, so take only what you need. I’m doing what I can to keep this place going, but it’s hard work. If you ever come across any seeds, or anything that might help, bring them my way. We’ve gotta think long-term if we’re going to make it.","\n","ev","str","^“I’ll keep that in mind. Thanks, Johnny.”","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^“I’ll see what I can find.”","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"end_conversation"},{"#f":5}],"c-1":["\n",{"->":"end_conversation"},{"#f":5}]}],{"#f":1}],"end_conversation":[["^JOHNNY:","\n","^Good luck out there. And remember—this land might be dying, but as long as we’re still here, there’s hope for something to grow.","\n","ev","str","^(Leave)","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","end","end",{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}