{"inkVersion":21,"root":[[{"->":"lily_intro"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"lily_intro":[["^LILY:","\n","^Hi! My name’s Lily. What’s yours? You look different from the others around here. Where did you come from?","\n","ev","str","^“I’m from... a long time ago, before all this happened.”","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^“I’ve been traveling for a while. What’s this place like?”","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^“Just trying to get by, like everyone else.”","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"ask_about_past"},{"#f":5}],"c-1":["\n",{"->":"ask_about_present"},{"#f":5}],"c-2":["\n",{"->":"ask_about_present"},{"#f":5}]}],{"#f":1}],"ask_about_present":[["^LILY:","\n","^This place? It’s all I’ve ever known. They say there used to be tall buildings, trees everywhere, and even animals that weren’t dangerous. But now it’s just... this. Everything’s broken, and people are always looking for food and water. Sometimes I find mushrooms, or a slice of bread, but that’s about it. They told me there used to be more, but I can’t even imagine it.","\n","ev","str","^“It wasn’t always like this. Things used to be different.”","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^“How do you find enough to eat?”","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^“Do you ever wonder what it was really like before?”","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"ask_about_past"},{"#f":5}],"c-1":["\n",{"->":"explain_hunger_mechanics"},{"#f":5}],"c-2":["\n",{"->":"ask_about_past"},{"#f":5}]}],{"#f":1}],"ask_about_past":[["^LILY:","\n","^You really remember what it was like before? What was it like? Did people really have enough food to eat every day? And what about the sky—was it really blue?","\n","ev","str","^“Yes, people had enough food, and the sky was blue. It was a different world.”","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^“Things were better in some ways, but we didn’t take care of the world like we should have.”","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^“It was nice, but we made mistakes. That’s why things are like this now.”","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"share_memories"},{"#f":5}],"c-1":["\n",{"->":"share_memories"},{"#f":5}],"c-2":["\n",{"->":"share_memories"},{"#f":5}]}],{"#f":1}],"share_memories":[["^LILY:","\n","^Wow... I wish I could’ve seen it. Sometimes, I try to imagine what it was like, but it’s hard. Everything here is so... gray. Do you think it could ever be like that again? Maybe if we all work together, we could fix things?","\n","ev","str","^“Maybe. It’ll take a lot of work, but I believe it’s possible.”","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^“I’m not sure. It might be too late for that.”","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^“We can try, Lily. That’s all we can do.”","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"explain_hunger_mechanics"},{"#f":5}],"c-1":["\n",{"->":"explain_hunger_mechanics"},{"#f":5}],"c-2":["\n",{"->":"explain_hunger_mechanics"},{"#f":5}]}],{"#f":1}],"explain_hunger_mechanics":[["^LILY:","\n","^Yeah, that’s what the others say too. For now, we just have to find what we can. The adults tell me not to eat anything but mushrooms, bread, or if I’m really lucky, a baguette. They say everything else is dangerous, like it’ll make you sick or worse. I don’t really get it, but I listen. Sometimes, I find a can of soda or some clean water, and that’s a good day. They say that’s all safe to drink, but everything else... no way.","\n","ev","str","^“That’s good advice, Lily. Stick to what’s safe.”","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^“It’s a hard way to live, but you’re doing well.”","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^“Just be careful. This world is dangerous.”","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"end_conversation"},{"#f":5}],"c-1":["\n",{"->":"end_conversation"},{"#f":5}],"c-2":["\n",{"->":"end_conversation"},{"#f":5}]}],{"#f":1}],"end_conversation":[["^LILY:","\n","^Thanks for talking with me. I like hearing about the way things used to be, even if I can’t really imagine it. Maybe one day, we’ll make things better again. See you around! If you ever find something cool, let me know, okay?","\n","ev","str","^(Leave)","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","end","end",{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}