{"inkVersion":21,"root":[[{"->":"emma_intro"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"emma_intro":[["^EMMA:","\n","^You must be the new one. I’m Emma. I oversee the lookouts here—make sure we gather what we can and keep an eye on any threats. We don’t have the luxury of missing anything, so I run a tight ship. My job’s to organize resource runs and make sure we don’t starve. It’s not easy, but it’s necessary. Out there, every piece of food, every drop of water counts. And I make sure we get it.","\n","ev","str","^“Sounds like a tough job. What is with this village?”","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^“What happened here?”","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^“What’s it like out there?”","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"air_pollution"},{"#f":5}],"c-1":["\n",{"->":"air_pollution"},{"#f":5}],"c-2":["\n",{"->":"air_pollution"},{"#f":5}]}],{"#f":1}],"air_pollution":[["^EMMA:","\n","^Used to be, this place was full of life. People packed into buildings, cars clogging the streets, the air so bad you could hardly breathe. And then... the collapse. When the climate really went to hell, the air became poison. Factories, cars, everything kept running until it was too late. People tried to adapt, but it didn’t matter. The pollution choked the city—literally and figuratively. That’s why we don’t waste anything now. Every breath, every bite could be your last if you’re not careful. So here’s the deal. We’ve got water—clean water—but we’re short on food. If you can bring back enough, I’ll make sure you’re set with water. You won’t find a better offer around here.","\n","ev","str","^“What exactly are you looking for?”","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^“Sounds fair. I’ll take the job.”","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^“I’m not sure if I’m up for this.”","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"quest_details"},{"#f":5}],"c-1":["\n",{"->":"accept_quest"},{"#f":5}],"c-2":["\n",{"->":"decline_quest"},{"#f":5}]}],{"#f":1}],"quest_details":[["^EMMA:","\n","^I need 2 slice of bread. Bring it to me, and I’ll trade you for water. Simple as that.","\n","ev","str","^“Alright, I’ll see what I can find.”","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^“That sounds risky, but I’ll give it a shot.”","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^“I don’t know if I’m ready for this.”","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"accept_quest"},{"#f":5}],"c-1":["\n",{"->":"accept_quest"},{"#f":5}],"c-2":["\n",{"->":"decline_quest"},{"#f":5}]}],{"#f":1}],"accept_quest":[["^EMMA:","\n","^Good. You get me those supplies, and you’ll have enough water to last you a while. Just remember—time’s ticking, and there’s always someone else willing to take the deal if you back out. Start out there.","\n","ev","str","^(Leave)","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","end",{"#f":5}]}],{"#f":1}],"decline_quest":[["^EMMA:","\n","^Your choice. Just remember, out here, you don’t get many second chances. If you change your mind, I might still have work for you. Might.","\n","ev","str","^(Leave)","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","end",{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}