{"inkVersion":21,"root":[[{"->":"industrial_zone_intro"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"industrial_zone_intro":[["^MARCUS:","\n","^This place… this was once the beating heart of production. Factories, refineries, assembly lines—everything you could imagine came out of here. It kept the world running, but at a cost. The pollution… you could taste it in the air. The rivers ran black, the skies were gray, and the people… well, they didn’t last long.","\n","ev","str","^(Continue)","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"industrial_zone"},{"#f":5}]}],{"#f":1}],"industrial_zone":[["^MARCUS:","\n","^The worst part is, we all knew what was happening. But no one wanted to stop. Profits were more important than the planet, more important than the people. And when the collapse came, this place was one of the first to fall. The machines stopped, the workers fled, and it all went silent. What’s left now… is just a ghost of what it used to be.","\n","ev","str","^\"It's hard to believe people lived like this.\"","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^\"It must have been terrible. How did people survive?\"","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^\"We’re close to the end now. What’s our plan?\"","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"reflect_on_past"},{"#f":5}],"c-1":["\n",{"->":"survival_in_industrial_zone"},{"#f":5}],"c-2":["\n",{"->":"explain_mission_industrial"},{"#f":5}]}],{"#f":1}],"reflect_on_past":[["^MARCUS:","\n","^Yeah, it’s hard to wrap your head around it. People got used to the filth, the sickness, the constant hum of machines. They didn’t realize what they were giving up until it was too late. By then, the damage was done, and there was no going back. But we’re here to make sure that what’s left of the world doesn’t end up the same way. We’ve got one last job to do.","\n","ev","str","^\"Right. Let’s make it count.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"I’m with you. What’s our next move?\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"explain_mission_industrial"},{"#f":5}],"c-1":["\n",{"->":"explain_mission_industrial"},{"#f":5}]}],{"#f":1}],"survival_in_industrial_zone":[["^MARCUS:","\n","^Survival wasn’t easy here. The people who worked in these factories didn’t have much choice. They took what little they could get—a paycheck, a place to live, even if it meant breathing in poison every day. When the collapse happened, those who could escape did. The rest… well, most didn’t make it. We’ve come this far. Let’s make sure their sacrifices weren’t in vain.","\n","ev","str","^\"I won’t let them down. What do we need to do?\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"Let’s finish what we started.\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"explain_mission_industrial"},{"#f":5}],"c-1":["\n",{"->":"explain_mission_industrial"},{"#f":5}]}],{"#f":1}],"explain_mission_industrial":[["^MARCUS:","\n","^This is it—the final piece of the puzzle. Somewhere in this mess is the last computer we need to get online. Just like before, we’ll need to find the hardware piece that fits. But remember, you only get one shot. Choose carefully, because once it’s in place, there’s no going back. Search everywhere. These old factories might be falling apart, but they’re full of nooks and crannies where the part could be hiding.","\n","ev","str","^\"Got it. I’ll be careful and thorough.\"","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^\"No mistakes this time. Let’s find that piece.\"","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^\"We’re almost there. Let’s do this.\"","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"prepare_for_search"},{"#f":5}],"c-1":["\n",{"->":"prepare_for_search"},{"#f":5}],"c-2":["\n",{"->":"prepare_for_search"},{"#f":5}]}],{"#f":1}],"prepare_for_search":[["^MARCUS:","\n","^Alright. This is the final stretch. Once we get this computer up and running, the power station should come online. Let’s make it happen.","\n","ev","str","^(Leave)","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","end",{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}