{"inkVersion":21,"root":[[{"->":"tom_intro"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"tom_intro":[["^TOM:","\n","^Come on… just a little more juice… Whoa, didn’t see you there! I guess I’m too used to being alone in these ruins. Name’s Tom. Used to be an electrician back in the day, before everything went to hell. You don’t look like the usual scavengers. What brings you to this godforsaken place?","\n","ev","str","^\"Just passing through. What about you?\"","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^\"Looking for parts. This place still has some value.\"","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^\"Trying to understand what happened here.\"","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"explain_what_he_does"},{"#f":5}],"c-1":["\n",{"->":"explain_his_task"},{"#f":5}],"c-2":["\n",{"->":"industrial_collapse"},{"#f":5}]}],{"#f":1}],"explain_what_he_does":[["^TOM:","\n","^Yeah, same here. I’m a resource collector now. Spent years working with power systems, so I guess you could say I’m trying to patch things up… literally. This place is a goldmine, if you know what to look for. Lots of old tech just waiting to be revived. Of course, most of it’s busted beyond repair, but sometimes you get lucky.","\n","ev","str","^\"Ever found anything really useful?\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"Sounds like you’ve been at this for a while.\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"tech_discovery"},{"#f":5}],"c-1":["\n",{"->":"time_in_ruins"},{"#f":5}]}],{"#f":1}],"explain_his_task":[["^TOM:","\n","^Parts, huh? Well, you’re in the right place. This zone used to be the beating heart of the city’s industry. If it had wires, gears, or circuits, it passed through here. Of course, most of it’s rusted to hell now. But with a bit of patience, you can still find something worth salvaging. I’ve been picking through these ruins for years, trying to get something, anything, back online.","\n","ev","str","^\"What are you working on now?\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"What’s been the hardest part of all this?\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"current_project"},{"#f":5}],"c-1":["\n",{"->":"challenges"},{"#f":5}]}],{"#f":1}],"industrial_collapse":[["^TOM:","\n","^Well, let me tell you… it didn’t happen overnight. This place used to be a powerhouse, churning out everything from electronics to heavy machinery. But that kind of production comes at a cost. The air here was so thick with pollution, you couldn’t see the sun most days. Factories didn’t care—they just kept running, burning through resources, poisoning the air and water. By the time the grid started failing, the damage was already done.","\n","ev","str","^\"How did people survive after that?\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"So, it was just a matter of time before everything fell apart?\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"post_collapse_survival"},{"#f":5}],"c-1":["\n",{"->":"inevitable_fall"},{"#f":5}]}],{"#f":1}],"tech_discovery":[["^TOM:","\n","^Once or twice. Found an old generator that still had some life in it a few months back. Managed to get it running long enough to power up a few lights in the settlement. You’d be amazed how much of a difference a little light makes in a place like this. Of course, the real challenge is keeping it going. Everything here’s on its last legs. But every now and then, you hit pay dirt.","\n","ev","str","^\"Sounds like you’re making progress.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"Must be tough, keeping things working.\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"progress_hopes"},{"#f":5}],"c-1":["\n",{"->":"challenges"},{"#f":5}]}],{"#f":1}],"time_in_ruins":[["^TOM:","\n","^Feels like forever. I’ve been coming here since right after the collapse. At first, it was just about survival—scavenging for anything useful. But then I started thinking… maybe we could fix some of it. Maybe we could bring back a little bit of what we lost. That’s what keeps me going. The hope that maybe, just maybe, we can rebuild.","\n","ev","str","^\"That’s a good way to think about it.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"It’s good to know someone’s still trying.\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"mission_briefing"},{"#f":5}],"c-1":["\n",{"->":"mission_briefing"},{"#f":5}]}],{"#f":1}],"current_project":[["^TOM:","\n","^Right now? Trying to jury-rig an old circuit board into something functional. Might be able to use it to power up a smaller generator. It’s a long shot, but… That’s what this life is now—one long series of long shots.","\n","ev","str","^\"Well, good luck with that.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"I hope it works out.\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"mission_briefing"},{"#f":5}],"c-1":["\n",{"->":"mission_briefing"},{"#f":5}]}],{"#f":1}],"challenges":[["^TOM:","\n","^Biggest challenge? Besides the obvious lack of resources? It’s the decay. Everything’s breaking down faster than we can fix it. Parts are rusted, wires are corroded… even when you find something, it’s a race against time to get it working before it falls apart in your hands. But that’s the game now. You’ve got to be quicker than the rot.","\n","ev","str","^\"Sounds like a tough job.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"Keep at it. We need people like you.\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"mission_briefing"},{"#f":5}],"c-1":["\n",{"->":"mission_briefing"},{"#f":5}]}],{"#f":1}],"post_collapse_survival":[["^TOM:","\n","^Survival wasn’t pretty. When the power went out, so did the order. No more rules, no more safety nets. People did what they had to—some banded together, others… didn’t. Those first few years were chaos. But eventually, things settled down. Small communities formed, scavenging became the way of life. And here we are, still picking through the bones of the old world.","\n","ev","str","^\"And trying to build something better?\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"It’s amazing anyone made it through.\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"progress_hopes"},{"#f":5}],"c-1":["\n",{"->":"mission_briefing"},{"#f":5}]}],{"#f":1}],"inevitable_fall":[["^TOM:","\n","^Yeah, it was. With the way things were going… it was only a matter of time. We pushed the world too hard, took too much, and didn’t give anything back. Eventually, it all broke down. But that doesn’t mean we can’t learn from it. We’ve got a chance to do things differently now. To rebuild smarter, better.","\n","ev","str","^\"Let’s make sure we do.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"I hope you’re right.\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"mission_briefing"},{"#f":5}],"c-1":["\n",{"->":"mission_briefing"},{"#f":5}]}],{"#f":1}],"progress_hopes":["^TOM:","\n","^Yeah. It’s slow, and it’s hard, but we’re making progress. Piece by piece, we’re putting things back together. It won’t be the same as before, but maybe that’s a good thing. We can’t afford to repeat the same mistakes. That’s why we’ve got to keep going, keep pushing forward. There’s still hope.","\n",{"->":"mission_briefing"},{"#f":1}],"mission_briefing":[["^TOM:","\n","^Alright, enough talk. You’re here for a reason, right? If you’re looking for electrical parts, keep your eyes peeled. There’s still some good stuff buried under all this rubble. Good luck out there.","\n","ev","str","^(Leave)","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","end",{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}