{"inkVersion":21,"root":[[{"->":"forest_path_intro"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"forest_path_intro":[["^MARCUS:","\n","^Would you look at that… I never thought I’d see this place like this again. The last time I was here, everything was dead. The trees were blackened, the ground cracked and lifeless. It was like the world had given up. But now… there’s life here. It’s like nature’s finally pushing back, reclaiming what was lost. I can’t say I expected to see this much green again in my lifetime. Maybe there’s hope after all.","\n","ev","str","^\"I’ve never seen anything like this. What happened here?\"","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^\"It’s beautiful… Hard to believe it was ever dead.\"","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^\"Glad to see something positive. What’s our plan here?\"","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"explain_past_forest"},{"#f":5}],"c-1":["\n",{"->":"reflect_on_recovery"},{"#f":5}],"c-2":["\n",{"->":"explain_mission_forest"},{"#f":5}]}],{"#f":1}],"explain_past_forest":[["^MARCUS:","\n","^After the fall, this place was hit hard. Pollution, wildfires, and the collapse of ecosystems turned it into a wasteland. No birds, no insects, just silence and death. I used to walk these paths when I was younger, back when it was alive with wildlife. Seeing it like that, it felt like losing a part of myself.","\n","ev","str","^(Continue)","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n",{"->":"explain_past_forest_cont"},{"#f":5}]}],{"#f":1}],"explain_past_forest_cont":[["^MARCUS:","\n","^But now… maybe we didn’t lose everything. Nature’s got a way of healing, given time. And seeing this… it reminds me that we’ve got to keep pushing forward. There’s still something worth fighting for.","\n","ev","str","^\"I agree. Let’s make sure we do our part.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"It’s good to hear there’s hope. What’s our next move?\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"explain_mission_forest"},{"#f":5}],"c-1":["\n",{"->":"explain_mission_forest"},{"#f":5}]}],{"#f":1}],"reflect_on_recovery":[["^MARCUS:","\n","^Yeah, it’s a sight, isn’t it? Sometimes it feels like the world’s determined to bounce back, no matter how much we’ve thrown at it. It’s a reminder that maybe, just maybe, things can get better if we work for it. But it’s a fragile thing. We can’t take it for granted. Alright, enough reminiscing. We’ve got a job to do here.","\n","ev","str","^\"Right. Let’s get to work.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"I’m with you. What do we need to do?\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"explain_mission_forest"},{"#f":5}],"c-1":["\n",{"->":"explain_mission_forest"},{"#f":5}]}],{"#f":1}],"explain_mission_forest":[["^MARCUS:","\n","^Same deal as before. Somewhere in this forest, there’s a piece of hardware we need. It could be tucked away in a broken-down cabin, buried under debris, or hidden in plain sight. You’ll need to search carefully. And remember—once you find it, you’ve only got one shot to place it in the right spot. The computer won’t do a thing until the hardware’s installed correctly. So, take your time, look for the right connection, and make sure it’s a good fit.","\n","ev","str","^\"Got it. Let's start searching.\"","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^\"I’ll be careful. We can’t afford to mess this up.\"","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^\"Let’s find that piece and get out of here.\"","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":"encourage_search_forest"},{"#f":5}],"c-1":["\n",{"->":"encourage_search_forest"},{"#f":5}],"c-2":["\n",{"->":"encourage_search_forest"},{"#f":5}]}],{"#f":1}],"encourage_search_forest":[["^MARCUS:","\n","^Once we’ve got that piece, we’ll find the computer and get it running. I will wait for you outside the Forest. And hey… maybe, once this is all over, we’ll have more places like this to walk through again. Let’s make sure of it.","\n","ev","str","^(Leave)","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["\n","end",{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}